app/views/home/index.html.erb

<script>
$(function() {
  $(".reply_submit").click(function(){

    post_id = this.value;
    post_content = $("#content_" + post_id).val();

    $.ajax({
      method: "POST",
      url: "/home/reply_write",
      data: {    content: post_content ,
              id_of_post: post_id},
      success: function(){

        $( "#reply_" + post_id ).append( "<p>" + post_content + "</p>");
        $("#content_" + post_id).val('');
        alert( "리플이 작성되었습니다." );
      },
      error: function(){
        alert( "리플이 작성되지 않았습니다.");
      }
    })
---
SELECT "posts".* FROM "posts"  ORDER BY id desc