app/controllers/home_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY id desc
---
  def index
    @posts = Post.all

INSERT INTO "replies" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "리플입니다."], ["post_id", 1], ["created_at", "2016-05-03 08:29:11.885603"], ["updated_at", "2016-05-03 08:29:11.885603"]]
---
  def reply_write
    reply = Reply.new
    reply.content = params[:content]
    reply.post_id = params[:id_of_post]
    reply.save

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "tt123"], ["content", "123"], ["created_at", "2016-05-03 07:39:39.054656"], ["updated_at", "2016-05-03 07:39:39.054656"]]
---
  def write
      post = Post.new
      post.title = params[:title]
      post.content = params[:content]
      post.save